---
kind: method
id: M:Autodesk.Revit.DB.Transform2D.Assign(Autodesk.Revit.DB.Transform2D)
zh: 赋值、设置值、写入
source: html/5646a58f-270e-aa89-505a-a0f293d76e83.htm
---
# Autodesk.Revit.DB.Transform2D.Assign Method

**中文**: 赋值、设置值、写入

Assigns values from the input transformation to this transformation.

## Syntax (C#)
```csharp
public void Assign(
	Transform2D from
)
```

## Parameters
- **from** (`Autodesk.Revit.DB.Transform2D`) - The transformation to use as input.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null